You have to work on the [University dataset](https://drive.google.com/drive/folders/1Hs3nRtK_F3h8eg59B4-TD1DEua6g8Klv?usp=sharing). It contains three different university rankings:
*  The Times Higher Education World University Ranking, shortly *Times*,
*  the Academic Ranking of World Universities, shortly *Shanghai*,
*  the Center for World University Rankings, shortly *cwur*.

### Notes

1.    It is mandatory to use GitHub for developing the project.
1.    The project must be a jupyter notebook.
1.    There is no restriction on the libraries that can be used, nor on the Python version.
1.    All questions on the project **must** be asked in a public channel on [Zulip](https://focs.zulipchat.com).

https://www.kaggle.com/mylesoneill/world-university-rankings

In [285]:
import pandas as pd

In [286]:
?pd.read_csv

In [287]:
url="https://drive.google.com/file/d/1bxVqGhJaNaP9s3ETJsFw4HR7Y7u_Lujc/view?usp=sharing"
path = 'https://drive.google.com/uc?export=download&id='+url.split('/')[-2]
times=pd.read_csv(path,na_values='-',sep=',')
times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,NaN,94.2,"7,929",8.4,27%,45 : 55,2011

In [288]:
url="https://drive.google.com/file/d/1rhjxG5mP_GlvAlLDdmWnrzDzfnSgAdcf/view?usp=sharing"
path = 'https://drive.google.com/uc?export=download&id='+url.split('/')[-2]
shanghai=pd.read_csv(path)
shanghai.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [289]:
url="https://drive.google.com/file/d/1KMbNlxJDdSQhT0LeBC0vGMOXUv0jTZGI/view?usp=sharing"
path = 'https://drive.google.com/uc?export=download&id='+url.split('/')[-2]
cwur=pd.read_csv(path)
cwur.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [290]:
#with pd.option_context('display.max_rows', None, 'display.max_columns', None):  # more options can be specified also
    #print(times[['university_name','num_students','year']])

### 1. For each university, extract from the *times* dataset the most recent and the least recent data, obtaining two separate dataframes

In [291]:
seri=times.groupby(['university_name','year']).size()
seri[seri>1] #La serie è vuota, quindi tutto bene

Series([], dtype: int64)

Ci siamo assicurati che ci fosse un'unica osservazione per ogni combinazione anno/università. Questo per non rischiare
di avere più massimi/minimi riferiti alla stessa università.

In [292]:
massimi_year=times.groupby('university_name').idxmax()['year']
massimi_year

university_name
AGH University of Science and Technology    2405
Aalborg University                          2003
Aalto University                            2056
Aarhus University                           1908
Aberystwyth University                      2105
                                            ...
École Normale Supérieure                    1856
École Normale Supérieure de Lyon            2013
École Polytechnique                         1904
École Polytechnique Fédérale de Lausanne    1833
Örebro University                           2134
Name: year, Length: 818, dtype: int64

Per ogni università abbiamo calcolato l'anno più recente a cui fanno riferimento i dati

In [293]:
most_recent=times.loc[massimi_year]
most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,NaN,"35,569",17.0,1%,NaN,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,NaN,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,"9,252",19.2,18%,48 : 52,2016

In [294]:
minimi_year=times.groupby('university_name').idxmin()['year']
minimi_year

university_name
AGH University of Science and Technology    2405
Aalborg University                           501
Aalto University                             502
Aarhus University                            166
Aberystwyth University                       476
                                            ...
École Normale Supérieure                      41
École Normale Supérieure de Lyon              99
École Polytechnique                           38
École Polytechnique Fédérale de Lausanne      47
Örebro University                           2134
Name: year, Length: 818, dtype: int64

In [295]:
least_recent=times.loc[minimi_year]
least_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,NaN,"35,569",17.0,1%,NaN,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,NaN,"17,422",15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,NaN,"16,099",24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,NaN,"9,252",19.2,18%,48 : 52,2012

### 2. For each university, compute the improvement in `income` between the least recent and the most recent data points

In [296]:
mergiato=pd.merge(most_recent[['university_name','income']],least_recent[['university_name','income']],on='university_name',suffixes=('_mostr', '_leastr'))
mergiato

                              university_name  income_mostr  income_leastr
0    AGH University of Science and Technology           NaN            NaN
1                          Aalborg University          43.7           36.4
2                            Aalto University          61.6           61.9
3                           Aarhus University          68.3           61.5
4                      Aberystwyth University          31.3           35.5
..                                        ...           ...            ...
813                  École Normale Supérieure          37.1           30.7
814          École Normale Supérieure de Lyon          31.7           26.1
815                       École Polytechnique          82.3            NaN
816  École Polytechnique Fédérale de Lausanne          65.4           38.0
817                         Örebro University          29.8           29.8

[818 rows x 3 columns]

In [297]:
mergiato['improvement']=mergiato['income_mostr']-mergiato['income_leastr']
mergiato

,university_name,income_mostr,income_leastr,improvement
0,AGH University of Science and Technology,NaN,NaN,NaN
1,Aalborg University,43.7,36.4,7.3
2,Aalto University,61.6,61.9,-0.3
3,Aarhus University,68.3,61.5,6.8
4,Aberystwyth University,31.3,35.5,-4.2
...,...,...,...,...
813,École Normale Supérieure,37.1,30.7,6.4
814,École Normale Supérieure de Lyon,31.7,26.1,5.6
815,École Polytechnique,82.3,NaN,NaN
816,École Polytechnique Fédérale de Lausanne,65.4,38.0,27.4
817,Örebro University,29.8,29.8,0.0

### 3. Find the university with the largest increase computed in the previous point

In [298]:
mergiato[mergiato['improvement']==mergiato['improvement'].max()]

    university_name  income_mostr  income_leastr  improvement
428      TU Dresden          99.7           31.9         67.8

Abbiamo usato questo procedimento perchè, a differenza della idxmax, ci permette di capire se 
esistono più di un'università con il maggiore improvement

### 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for *Aarhus University* the value is 122-73=49). Notice that some rankings are expressed as a range

In [299]:
most_recent[most_recent['university_name']=='Aarhus University']

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016

In [300]:
most_recent2=shanghai.loc[shanghai.groupby('university_name').idxmax()['year']]
most_recent2.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015
4497,101-150,Aix Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011

In [301]:
most_recent3=cwur.loc[cwur.groupby('institution').idxmax()['year']]
most_recent3.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,44.26,2015
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,44.59,2015
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,45.10,2015
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,44.22,2015

In [302]:
lista=['university_name','world_rank']
appo=pd.merge(most_recent[lista],most_recent2[lista], on='university_name',suffixes=('_1', '_2'))

In [303]:
riassunto=pd.merge(appo,most_recent3[['institution','world_rank']], left_on='university_name',right_on='institution')
riassunto.drop('institution', axis=1,inplace=True)
riassunto.rename(columns={"world_rank": "world_rank_3"},inplace=True)
riassunto

,university_name,world_rank_1,world_rank_2,world_rank_3
0,Aalborg University,201-250,301-400,565
1,Aalto University,251-300,401-500,421
2,Aarhus University,=106,73,122
3,Aix-Marseille University,251-300,102-150,206
4,Aristotle University of Thessaloniki,601-800,401-500,459
...,...,...,...,...
357,Yale University,12,11,11
358,Yeshiva University,=164,201-300,171
359,Yonsei University,301-350,201-300,98
360,York University,301-350,401-500,337
361,Zhejiang University,251-300,101-150,191

In [304]:
riassunto.isnull().sum()

university_name    0
world_rank_1       0
world_rank_2       0
world_rank_3       0
dtype: int64

In [305]:
print(riassunto['world_rank_1'].dtype)
print(riassunto['world_rank_2'].dtype)
print(riassunto['world_rank_3'].dtype)

object
object
int64

In [306]:
riassunto['world_rank_1'].str.contains('^=?\d+-?(\d+)?').sum()

c:\users\andrea\appdata\local\programs\python\python36-32\lib\site-packages\pandas\core\strings.py:2001: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

362

In [284]:
riassunto

,university_name,world_rank_1,world_rank_2,world_rank_3
0,Aalborg University,201-250,301-400,565
1,Aalto University,251-300,401-500,421
2,Aarhus University,=106,73,122
3,Aix-Marseille University,251-300,102-150,206
4,Aristotle University of Thessaloniki,601-800,401-500,459
...,...,...,...,...
357,Yale University,12,11,11
358,Yeshiva University,=164,201-300,171
359,Yonsei University,301-350,201-300,98
360,York University,301-350,401-500,337
361,Zhejiang University,251-300,101-150,191

In [316]:
def sostituzione(row,colonna):
    p1=row[colonna].strip('=').split('-')
    if(len(p1)==1):
        return int(p1[0])
    else:
        return (int(p1[0])+int(p1[1]))//2
riassunto['new_world_rank_1']=riassunto.apply(sostituzione,axis=1,args=('world_rank_1',))
riassunto['new_world_rank_2']=riassunto.apply(sostituzione,axis=1,args=('world_rank_2',))
riassunto

,university_name,world_rank_1,world_rank_2,world_rank_3,new_world_rank_1,new_world_rank_2
0,Aalborg University,201-250,301-400,565,225,350
1,Aalto University,251-300,401-500,421,275,450
2,Aarhus University,=106,73,122,106,73
3,Aix-Marseille University,251-300,102-150,206,275,126
4,Aristotle University of Thessaloniki,601-800,401-500,459,700,450
...,...,...,...,...,...,...
357,Yale University,12,11,11,12,11
358,Yeshiva University,=164,201-300,171,164,250
359,Yonsei University,301-350,201-300,98,325,250
360,York University,301-350,401-500,337,325,450
361,Zhejiang University,251-300,101-150,191,275,125

In [315]:
import re
def sostituzione(row,colonna):
    reg=re.compile('^(\d+)$')
    occurrence=reg.search(row[colonna])
    reg2=re.compile('^(\d+)-(\d+)$')
    occurrence2=reg2.search(row[colonna])
    if(row[colonna][0]=='='):
        return int(row[colonna][1:])
    elif(occurrence):
        return int(occurrence.group(1))
    else:
        return (int(occurrence2.group(1))+int(occurrence2.group(2)))//2
riassunto['new_world_rank_1']=riassunto.apply(sostituzione,axis=1,args=('world_rank_1',))
riassunto['new_world_rank_2']=riassunto.apply(sostituzione,axis=1,args=('world_rank_2',))
riassunto

,university_name,world_rank_1,world_rank_2,world_rank_3,new_world_rank_1,new_world_rank_2
0,Aalborg University,201-250,301-400,565,225,350
1,Aalto University,251-300,401-500,421,275,450
2,Aarhus University,=106,73,122,106,73
3,Aix-Marseille University,251-300,102-150,206,275,126
4,Aristotle University of Thessaloniki,601-800,401-500,459,700,450
...,...,...,...,...,...,...
357,Yale University,12,11,11,12,11
358,Yeshiva University,=164,201-300,171,164,250
359,Yonsei University,301-350,201-300,98,325,250
360,York University,301-350,401-500,337,325,450
361,Zhejiang University,251-300,101-150,191,275,125

In [317]:
def differenza_max(row):
    lista=[row['world_rank_3'],row['new_world_rank_1'],row['new_world_rank_2']]
    return max(lista)-min(lista)
riassunto['differenza_massima']=riassunto.apply(differenza_max,axis=1)

In [318]:
riassunto

,university_name,world_rank_1,world_rank_2,world_rank_3,new_world_rank_1,new_world_rank_2,differenza_massima
0,Aalborg University,201-250,301-400,565,225,350,340
1,Aalto University,251-300,401-500,421,275,450,175
2,Aarhus University,=106,73,122,106,73,49
3,Aix-Marseille University,251-300,102-150,206,275,126,149
4,Aristotle University of Thessaloniki,601-800,401-500,459,700,450,250
...,...,...,...,...,...,...,...
357,Yale University,12,11,11,12,11,1
358,Yeshiva University,=164,201-300,171,164,250,86
359,Yonsei University,301-350,201-300,98,325,250,227
360,York University,301-350,401-500,337,325,450,125
361,Zhejiang University,251-300,101-150,191,275,125,150

If some values in column are missing (NaN) and then converted to numeric, always dtype is float. You cannot convert values to int. Only to float, because type of NaN is float.

### 5. Consider only the most recent data point of the *times* dataset. Compute the number of male and female students for each country.

### 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

### 7. For each country compute the fraction of students that are in one of the universities computed in the previous point.

### 8. Read the file `educational_attainment_supplementary_data.csv`, discarding any row without `country_name` or `series_name`

### 9. From `attainment` build a dataframe with the same data, but with 4 columns: `country_name`, `series_name`, `year`, `value`

### 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

### 11. In the times ranking, compute the number of times each university appears

### 12. Find the universities that appear at most twice in the times ranking.

### 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).